{
  "basics": {
    "name": "Erick Edel Beltrán",
    "label": "Full Stack Developer con más de 2 años de experiencia",
    "image": "/pic.webp",
    "email": "erickedelbeltran@gmail.com",
    "phone": "+52 6681293263",
    "url": "https://midu.dev",
    "summary": "Ingeniero Mecatrónico con más de 2 años de experiencia en desarrollo de software.  Poseo habilidades tanto en desarrollo FrontEnd como Backend, lo que me permite tener una visión completa, con una notable capacidad para concentrarme e innovar.",
    "location": {
      "address": "",
      "postalCode": "08820",
      "city": "Sinaloa",
      "countryCode": "ES",
      "region": "México"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "erickedelbeltran",
        "url": "https://www.linkedin.com/in/erickedelbeltran/"
      },
      {
        "network": "GitHub",
        "username": "Edel-blk",
        "url": "https://github.com/Edel-blk"
      }
    ]
  },
  "work": [
    {
      "name": "Ola Technologies",
      "position": "Full Stack Web Developer",
      "url": "https://twitch.tv/midudev",
      "startDate": "2022-02-01",
      "endDate": null,
      "summary": "En mi posición actual, me desempeño en la creación de nuevas vistas web y funcionalidades interactivas utilizando React. También me encargo del mantenimiento de aplicaciones Android mediante React Native y Expo, así como de la gestión de funcionalidades ya existentes en páginas web utilizando React, JavaScript, Node.js y Saga. En este rol, desarrollo componentes reutilizables para vistas complejas, como filtros, layouts y menús desplegables, asegurando un diseño responsivo en todas las vistas. Además, me responsabilizo del testing unitario antes de la implementación en producción y del mantenimiento de plantillas de correo para envíos masivos. Asimismo, gestiono la implementación y mantenimiento de servicios de API para CRM ZOHO."
    },
    {
      "name": "Xira",
      "position": "Soporte",
      "url": "https://twitch.tv/midudev",
      "startDate": "2021-08-01",
      "endDate": "2022-02-01",
      "summary": "Me encargaba de la monitorización diaria y mantenimiento de soluciones mediante Puppeteer. Resolvía tickets de problemas y bugs, abordando áreas como web scraping y administración de servidores (Linux, Windows). Participaba activamente en reuniones semanales con clientes, implementaba sistemas de monitoreo y lideraba la migración de soluciones Legacy a ECMAScript 6. Además, contribuí en la capacitación e implementación de inteligencia artificial en nuevos productos."
    }
  ],
  "skills": [
    {
      "name": "JavaScript"
    },
    {
      "name": "Java"
    },
    {
      "name": "C#"
    },
    {
      "name": "Node"
    },
    {
      "name": "MySQL"
    },
    {
      "name": "SQL server"
    },
    {
      "name": "MongoDB"
    },
    {
      "name": "Git"
    },
    {
      "name": "GitHub"
    },
    {
      "name": "React"
    },
    {
      "name": "React Native"
    },
    {
      "name": "Redux"
    },
    {
      "name": "HTML"
    },
    {
      "name": "CSS"
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Advanced"
    }
  ],
  "projects": [
    {
      "name": "project",
      "isActive": true,
      "description": "project description",
      "highlights": [
        "Elige tu propia aventura",
        "En desarrollo"
      ],
      "url": "www.google.com"
    }
  ]
}